perf/async-catalog-report-load-report/statistics.json
{
  "POST start async catalog report" : {
    "transaction" : "POST start async catalog report",
    "sampleCount" : 30000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 965.9498333333303,
    "medianResTime" : 1198.0,
    "minResTime" : 0.0,
    "maxResTime" : 2927.0,
    "pct1ResTime" : 1888.0,
    "pct2ResTime" : 2033.0,
    "pct3ResTime" : 2348.0,
    "throughput" : 1515.6873642196736,
    "receivedKBytesPerSec" : 356.7193894306068,
    "sentKBytesPerSec" : 353.75906254736526
  },
  "GET async job status" : {
    "transaction" : "GET async job status",
    "sampleCount" : 60000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 951.1362166666704,
    "medianResTime" : 445.0,
    "minResTime" : 0.0,
    "maxResTime" : 2483.0,
    "pct1ResTime" : 1047.0,
    "pct2ResTime" : 1125.0,
    "pct3ResTime" : 1444.0,
    "throughput" : 3389.639003446133,
    "receivedKBytesPerSec" : 1309.0039382485452,
    "sentKBytesPerSec" : 797.7568357719903
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 90000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 956.0740888888987,
    "medianResTime" : 427.0,
    "minResTime" : 0.0,
    "maxResTime" : 2927.0,
    "pct1ResTime" : 785.0,
    "pct2ResTime" : 884.0,
    "pct3ResTime" : 1200.0,
    "throughput" : 4271.273314033506,
    "receivedKBytesPerSec" : 1434.7314121749084,
    "sentKBytesPerSec" : 1002.4700714251815
  }
}